БухЭксп/Catalogs/CW_ВебПрофили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПрофили</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПереводитьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОсновногоОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтбораДокументов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПереводаВАрхив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПереводаВАрхив</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНаАнглийском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНаРусском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьФинансовыеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектПечатныхФорм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_КомплектыПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДополнительнойИнформации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТипФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАрхивныхГрузоперевозок</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенРазделЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноСозданиеЗавок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенРазделПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрофиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебШаблоныПрофилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтбораОтчетЗадоженность</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенРазделОтчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемыйВариантОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПрофиля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектХарактеристики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВариантыФиксацииКолонок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БыстрыйОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенФормат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляСортировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокСортировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныЗаявок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ВебШаблоныЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресУведомлений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонПисьма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВариантыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступныеПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступныеПользователи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПользователиВебПрофилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПользователиВебПрофилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиЗаявок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиПеревозок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Comment>"ГРУЗОПЕРЕВОЗКИ", "ЗАЯВКИ"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПользователиЛКК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПользователиЛКК</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПечатныеФормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентифкаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПрофили/Forms/ФормаОсновногоПрофиля/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Наименование	= "Новый";
		Заголовок = "Профиль личного кабинета (Создание профиля)";
	КонецЕсли;   
	
	ОбъектШаблонаПисьмаЗаявок 	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(тип("СправочникСсылка.CW_ВебШаблоныЗаявок"));    
	ИдентификаторОтчета  		= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(тип("ОтчетОбъект.CW_ЛичныйКабинетДебиторскаЗадолженность")); 
	
	УстановитьВидимостьКомплектаПечатныхФорм();
	УстановитьОтборыДинамическихСписков();
	ЗаполнитьСписокПользователейПрофиля();
	УстановитьДоступностьЭлементовДляНовогоОбъекта();  
	ДоступенРазделОтчетыПриИзмененииНаСервере();
	ИспользуемыйВариантОтчетаПриИзмененииНаСервере(); 
	УстановитьДоступностьРазделаПеревозокНаСервере();
	УстановитьДоступностьРазделаЗаявокнаСервере();
	
	ПроверитьНаличиеОтбора(АдресНастроекОтбораДокументов, 			"НастройкаОтбораДокументов");
	ПроверитьНаличиеОтбора(АдресНастроекОтбораОтчетЗадолженность, 	"НастройкаОтбораОтчетЗадолженность");

КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  
	
	УстановитьАдресНастроекОтборов(ТекущийОбъект); 
	УстановитьАдресСхемыДокументов(ТекущийОбъект);   
	
	ЗаполнитьДополнительныеКолнкиВариантовОтчета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеКолнкиВариантовОтчета()
	
	Для Каждого СтрокаВарианта из Объект.ДоступныеВариантыОтчета Цикл
		СтрокаВарианта.КомандаСтроки = "Сформировать";
	КонецЦикла;

КонецПроцедуры  

&НаСервере
Процедура УстановитьАдресСхемыДокументов(ТекущийОбъект)
	
	СхемаОтбораДокументов = ТекущийОбъект.ПолучитьМакет("СхемаОтбораДокументов");
	АдресСхемыДокументов  = ПоместитьВоВременноеХранилище(СхемаОтбораДокументов,Этаформа.УникальныйИдентификатор);

	СхемаДебиторскаяЗадолженность = ТекущийОбъект.ПолучитьМакет("ДебиторскаяЗадолженность");
	АдресСхемыДебиторскаяЗадолженность  = ПоместитьВоВременноеХранилище(СхемаДебиторскаяЗадолженность,Этаформа.УникальныйИдентификатор);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьАдресНастроекОтборов(ТекущийОбъект)
	
	//Отбор документов
	НастройкиОтбораДокументов 		= ТекущийОбъект.НастройкиОтбораДокументов.Получить();
	Если НастройкиОтбораДокументов <> Неопределено Тогда
		АдресНастроекОтбораДокументов = ПоместитьВоВременноеХранилище(НастройкиОтбораДокументов, Новый УникальныйИдентификатор); 
	Иначе
		АдресНастроекОтбораДокументов = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор); 
	КонецЕсли;     
	
	//Отбор отчетов
	//Задолженность
	НастройкиОтбораОтчетЗадоженность 		= ТекущийОбъект.НастройкиОтбораОтчетЗадоженность.Получить();
	Если НастройкиОтбораОтчетЗадоженность <> Неопределено Тогда
		АдресНастроекОтбораОтчетЗадолженность = ПоместитьВоВременноеХранилище(НастройкиОтбораОтчетЗадоженность, Новый УникальныйИдентификатор); 
	Иначе
		АдресНастроекОтбораОтчетЗадолженность = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор); 
	КонецЕсли;     
	
КонецПроцедуры 


&НаСервере
Процедура УстановитьДоступностьЭлементовДляНовогоОбъекта()
	
	Элементы.ПользователиПрофиля.Доступность = Не Объект.Ссылка.Пустая();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПользователейПрофиля() 
	
	мИдентифкаторыАктивныхПользователей = Справочники.CW_ВебПользователиЛКК.ПолучитьМассивИдентификаторовАктивныхПользователей();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступныеПользователи.Пользователь КАК Пользователь,
	               |	CW_ДоступныеПользователи.Пользователь.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	               |	CW_ДоступныеПользователи.Пользователь.Язык КАК Язык,
	               |	CW_ДоступныеПользователи.Пользователь.ВыгружатьПечатныеФормы КАК ПечатныеФормы,
	               |	CW_ДоступныеПользователи.Пользователь.ВыгружатьФайлы КАК ВыгружатьФайлы,
	               |	CW_ДоступныеПользователи.Пользователь.ИдентифкаторПользователя КАК ИдентифкаторПользователяИБ,
	               |	ВЫБОР
	               |		КОГДА CW_ДоступныеПользователи.Пользователь.ПометкаУдаления
	               |			ТОГДА 4
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК СтатусЭлемента,
	               |	ВЫБОР
	               |		КОГДА CW_ДоступныеПользователи.Пользователь.ИдентифкаторПользователя В (&мИдентифкаторыАктивныхПользователей)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Активный
	               |ИЗ
	               |	РегистрСведений.CW_ДоступныеПользователи КАК CW_ДоступныеПользователи
	               |ГДЕ
	               |	CW_ДоступныеПользователи.ВебПрофиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль" , Объект.Ссылка);
	Запрос.УстановитьПараметр("мИдентифкаторыАктивныхПользователей" , мИдентифкаторыАктивныхПользователей);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ПользователиПрофиля.Очистить();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ПользователиПрофиля.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ЛК = ЗначениеЗаполнено(Выборка.ИдентифкаторПользователяИБ);
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборыДинамическихСписков()
	
	Отбор = ВебПрофилиПеревозок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	Отбор.ПравоеЗначение = ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);
	Отбор.Использование = Истина;
	
	Отбор = ВебПрофилиЗаявок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	Отбор.ПравоеЗначение = ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);
	Отбор.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПользователяПрофиля(ВладелецФормы)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.CW_ВебПользователиЛКК.ФормаВыбора",ПараметрыФормы,ВладелецФормы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтборыДинамическихСписков();
	УстановитьДоступностьЭлементовДляНовогоОбъекта();   

	ЗаполнитьДополнительныеКолнкиВариантовОтчета();
	
	Если Не Объект.ДоступенРазделЗаявки Тогда
		УдалитьЗаписиПрофилиейПользователей();	
	КонецЕсли;
	
	мПользователиПрофиля = ПользователиПрофиля.Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	РегистрыСведений.CW_ДоступныеПользователи.ЗаписатьПользователейПрофиля(Объект.Ссылка, мПользователиПрофиля);
	
КонецПроцедуры   

&НаСервере
Процедура УдалитьЗаписиПрофилиейПользователей()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ОсновнойПрофиль", Объект.Ссылка);
	СтруктураОтбора.Вставить("Раздел", 			"ЗАЯВКИ");
	
	РегистрыСведений.CW_ПользователиВебПрофилей.УдалитьЗаписьПрофилей(СтруктураОтбора);
	
КонецПроцедуры


&НаКлиенте
Процедура ПользователиПрофиляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередНачаломДобавленияПользователяПрофиля", Элемент);
		ПоказатьВопрос(Оповещение, "Элемент справочника будет записан. Продлолжить?", Режим, 0);
	Иначе
		ОткрытьФормуПользователяПрофиля(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередНачаломДобавленияПользователяПрофиля(Результат, ВладелецФормы) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	ОткрытьФормуПользователяПрофиля(ВладелецФормы);
	
КонецПроцедуры


&НаКлиенте
Процедура ПользователиПрофиляПередУдалением(Элемент, Отказ)
	
	Отказ = истина;
	
	ИдентифкаторСтроки = Элементы.ПользователиПрофиля.ТекущаяСтрока;
	
	Если ИдентифкаторСтроки <> Неопределено Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииПользователя", ЭтотОбъект, ИдентифкаторСтроки);
		ПоказатьВопрос(Оповещение,"Удалить пользователя из списка пользователей веб-профиля?", Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбудаленииПользователя(Результат, ИдентифкаторСтроки) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	                                                    														 
	УдалитьПользователяИзСпискаНаСервере(ИдентифкаторСтроки);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПользователяИзСпискаНаСервере(ИдентифкаторСтроки)
	
	СтрокаПользователей = ПользователиПрофиля.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	РегистрыСведений.CW_ДоступныеПользователи.УдалитьЗаписьПользователя(Объект.Ссылка, СтрокаПользователей.Пользователь);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ОсновнойПрофиль", Объект.Ссылка);
	СтруктураОтбора.Вставить("Пользователь",	СтрокаПользователей.Пользователь);
	
	РегистрыСведений.CW_ПользователиВебПрофилей.УдалитьЗаписьПрофилей(СтруктураОтбора);	
	
	ПользователиПрофиля.Удалить(ПользователиПрофиля.Индекс(СтрокаПользователей));
	
КонецПроцедуры


&НаКлиенте
Процедура ПользователиПрофиляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыОтбора = новый Структура("Пользователь", ВыбранноеЗначение);
	мСтроки = ПользователиПрофиля.НайтиСтроки(ПараметрыОтбора);
	
	Если мСтроки.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, "Пользователь уже есть в списке!");
		
	Иначе
		
		Модифицированность = истина;
		НоваяСтрока = ПользователиПрофиля.Добавить();
		НоваяСтрока.Пользователь = ВыбранноеЗначение;
		
		ЗаполнитьДанныеСтрокиНаСервере(НоваяСтрока.ПолучитьИдентификатор());
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтрокиНаСервере(ИдентификаторСтроки)
	
	СтрокаПользователя = ПользователиПрофиля.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаПользователя.ЛК  = ЗначениеЗаполнено(СтрокаПользователя.Пользователь.ИдентифкаторПользователя);
	
	СтрокаПользователя.ЭлектроннаяПочта	= СтрокаПользователя.Пользователь.ЭлектроннаяПочта;
	СтрокаПользователя.Язык  			= СтрокаПользователя.Пользователь.Язык;
	СтрокаПользователя.ПечатныеФормы  	= СтрокаПользователя.Пользователь.ВыгружатьПечатныеФормы;
	СтрокаПользователя.ВыгружатьФайлы  	= СтрокаПользователя.Пользователь.ВыгружатьФайлы;
	
	СтрокаПользователя.СтатусЭлемента  	= ?(СтрокаПользователя.Пользователь.ПометкаУдаления, 4, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПрофиляПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = истина;
	
	ТекущиеДанные = Элементы.ПользователиПрофиля.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущаяСтрока = Элементы.ПользователиПрофиля.ТекущаяСтрока;
		
		СтруктураПараметров = новый Структура;
		СтруктураПараметров.Вставить("Ключ", ТекущиеДанные.Пользователь);
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыпользователя", ЭтотОбъект, ТекущаяСтрока);
		
		ОткрытьФорму("Справочник.CW_ВебПользователиЛКК.ФормаОбъекта", СтруктураПараметров, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПрофиляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуПользователя(ВыбраннаяСтрока);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПользователиИзменить(Команда) 

	ТекущаяСтрока = Элементы.ПользователиПрофиля.ТекущаяСтрока;
	ОткрытьФормуПользователя(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПользователя(Знач ВыбраннаяСтрока)
	
	ТекущиеДанные = Элементы.ПользователиПрофиля.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		СтруктураПараметров = новый Структура;
		СтруктураПараметров.Вставить("Ключ", ТекущиеДанные.Пользователь);
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыпользователя", ЭтотОбъект, ВыбраннаяСтрока);
		
		ОткрытьФорму("Справочник.CW_ВебПользователиЛКК.ФормаОбъекта", СтруктураПараметров, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры     


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыпользователя(Результат, ИдентификаторСтроки) Экспорт
	
	ЗаполнитьДанныеСтрокиНаСервере(ИдентификаторСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 

	Если Объект.ДоступенРазделОтчеты 
		и Не Объект.ВыводитьЗадолженность  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран отчет для отображения в личном кабинете!",,"ВыводитьЗадолженность","Объект", Отказ);
	КонецЕсли;
	
	Если Объект.ВыводитьЗадолженность 
		и Объект.ИспользуемыйВариантОтчета = 1 
		и Объект.ДоступныеВариантыОтчета.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для отчета о задолженности не указаны дополнительные варианты отчета!",,"ДоступныеВариантыОтчета","Объект", Отказ);
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекОтбораДокументов) Тогда     
		Если Объект.ВыводитьФинансовыеДокументы Тогда
			Если Не ПроверитьНаличиеОтбора(АдресНастроекОтбораДокументов, "НастройкаОтбораДокументов") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не настроен отбор финансовых документов!",,"ВыводитьФинансовыеДокументы","Объект", Отказ);
			Конецесли;
			Если Не ЗначениеЗаполнено(Объект.КомплектПечатныхФорм) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан комплект печатных форм",,"КомплектПечатныхФорм","Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		ТекущийОбъект.НастройкиОтбораДокументов = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекОтбораДокументов)); 
	КонецЕсли; 	
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекОтбораОтчетЗадолженность) Тогда     
		Если Объект.ДоступенРазделОтчеты и Объект.ВыводитьЗадолженность Тогда
			Если Не ПроверитьНаличиеОтбора(АдресНастроекОтбораОтчетЗадолженность, "НастройкаОтбораОтчетЗадолженность") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не настроен отбор отчета о задолженности!",,"ВыводитьЗадолженность","Объект", Отказ); 
			Конецесли;
		КонецЕсли;
		
		ТекущийОбъект.НастройкиОтбораОтчетЗадоженность = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекОтбораОтчетЗадолженность)); 
	КонецЕсли; 	
	
КонецПроцедуры  

&НаСервере
Функция ПроверитьНаличиеОтбора(АдресСхемы, ИмяКнопки)

	ОтборНастроен = Ложь;  
	
	Если Не ЭтоАдресВременногоХранилища(АдресСхемы) Тогда
		ЦветТекстаКнопкиОтбора = ЦветаСтиля.ЦветОтрицательногоЧисла;
		Элементы[ИмяКнопки].ЦветТекста = ЦветТекстаКнопкиОтбора;
		Возврат ОтборНастроен;
	Конецесли;
	
	ЦветТекстаКнопкиОтбора = Новый Цвет;

	НастройкиКомпановки = ПолучитьИзВременногоХранилища(АдресСхемы);
	Если НастройкиКомпановки <> Неопределено Тогда
		Для Каждого ЭлементОбора из	НастройкиКомпановки.Отбор.Элементы Цикл
			Если ЭлементОбора.Использование Тогда
				ОтборНастроен = истина;
				Прервать;
			КонецЕсли;                                
		КонецЦикла;                             
	КонецЕсли;  
	
	Если Не ОтборНастроен Тогда
		ЦветТекстаКнопкиОтбора = ЦветаСтиля.ЦветОтрицательногоЧисла;
	КонецЕсли;
	
	Элементы[ИмяКнопки].ЦветТекста = ЦветТекстаКнопкиОтбора;
	
	Возврат ОтборНастроен; 

КонецФункции

//Отбор документов 
&НаКлиенте
Процедура НастройкаОтбораДокументов(Команда)     
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать элемент справочнка!");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлемента",		"НастройкаОтбораДокументов");  
	ДополнительныеПараметры.Вставить("СхемаКомпоновки",	АдресСхемыДокументов);  
	ДополнительныеПараметры.Вставить("АдресНастроек",	АдресНастроекОтбораДокументов);  
	ДополнительныеПараметры.Вставить("Записать",		Ложь);  
	
	Оповещение = Новый ОписаниеОповещения("ВопросПередНачаломНастроекОтбора", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Объект.Ссылка.Пустая() Тогда
		ДополнительныеПараметры.Вставить("Записать", Истина);  
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Элемент справочника будет записан. Продлолжить?", Режим, 0);
	Иначе  
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросПередНачаломНастроекОтбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Записать Тогда
		ЭтаФорма.Записать();                       
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияОтбора", ЭтотОбъект, ДополнительныеПараметры);  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийПрофиль",	Объект.Ссылка);
	ПараметрыФормы.Вставить("СхемаКомпоновки",	ДополнительныеПараметры.СхемаКомпоновки);
	ПараметрыФормы.Вставить("АдресНастроек",	ДополнительныеПараметры.АдресНастроек);
	
	ОткрытьФорму("Справочник.CW_ВебПрофили.Форма.НастройкаОтбора",ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаИзмененияОтбора(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		ТекущиеНастройкиОтбора	= ПолучитьИзВременногоХранилища(Результат);
		ПоместитьВоВременноеХранилище(ТекущиеНастройкиОтбора, ДополнительныеПараметры.АдресНастроек);
	КонецЕсли;
	
	ПроверитьНаличиеОтбора(ДополнительныеПараметры.АдресНастроек, ДополнительныеПараметры.ИмяЭлемента);
	
	МодификацияСтруктуры = Истина;
		
КонецПроцедуры


&НаКлиенте
Процедура ВыводитьФинансовыеДокументыПриИзменении(Элемент)
	
	УстановитьВидимостьКомплектаПечатныхФорм(); 
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьВидимостьКомплектаПечатныхФорм()
	
	Элементы.КомплектПечатныхФорм.Видимость 		= Объект.ВыводитьФинансовыеДокументы;
	Элементы.НастройкаОтбораДокументов.Видимость	= Объект.ВыводитьФинансовыеДокументы; 
	Элементы.ВыводитьЗадолженность.Видимость		= Объект.ВыводитьФинансовыеДокументы;

 	Элементы.ГруппаДоступныеВариантыОтчета.Видимость	= Объект.ВыводитьЗадолженность;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗадолженностьПриИзменении(Элемент)
	
	Если Не Объект.ВыводитьЗадолженность Тогда
		Объект.УведомлятьОЗадолженности = Ложь;
	КонецЕсли;     
	
	Элементы.НастройкаОтбораОтчетЗадолженность.Видимость = Объект.ВыводитьЗадолженность;
	Элементы.УведомлятьОЗадолженности.Видимость 		 = Объект.УведомлятьОЗадолженности;
	 
	УстановитьВидимостьКомплектаПечатныхФорм();
	
КонецПроцедуры
//Отбор документов      

&НаКлиенте
Процедура ДоступенРазделЗаявкиПриИзменении(Элемент)   
	
	Если НЕ Объект.ДоступенРазделЗаявки Тогда
		Объект.ДоступноСозданиеЗавок = Ложь;
	КонецЕсли;   
	
	УстановитьДоступностьРазделаЗаявокнаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьРазделаЗаявокнаСервере()
	
	Элементы.ГруппаПрофилиЗаявок.Видимость 		= Объект.ДоступенРазделЗаявки;
	Элементы.ДоступноСозданиеЗавок.Видимость 	= Объект.ДоступенРазделЗаявки;
	Элементы.ГруппаСозданиеЗаявок.Видимость 	= Объект.ДоступноСозданиеЗавок;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблон(Команда)

	ТекущиеДанные = Элементы.ШаблоныЗаявок.ТекущиеДанные;
	ПоказатьЗначение(, ТекущиеДанные.Шаблон);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеRUОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", Объект.ПредставлениеRU);
	СтруктураПараметров.Вставить("EN", Объект.ПредставлениеEN); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "Представление");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводТекстаНаРазныхЯзыках", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаврешитьВводТекстаНаРазныхЯзыках(РезультатВвода, ДополнительныеПараметры) Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаврешитьЗаврешитьВводТекстаНаРазныхЯзыкахНаСервере(РезультатВвода, ДополнительныеПараметры.Реквизит);

	Модифицированность = истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаврешитьЗаврешитьВводТекстаНаРазныхЯзыкахНаСервере(РезультатВвода, ИмяРеквизита)
	
	Для Каждого КлючЗначение из РезультатВвода Цикл
		Объект[ИмяРеквизита + КлючЗначение.Ключ] = КлючЗначение.Значение; 
	КонецЦикла;    
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкаОтбораОтчетЗадолженность(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать элемент справочнка!");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлемента",		"НастройкаОтбораОтчетЗадолженность");  
	ДополнительныеПараметры.Вставить("СхемаКомпоновки",	АдресСхемыДебиторскаяЗадолженность);  
	ДополнительныеПараметры.Вставить("АдресНастроек",	АдресНастроекОтбораОтчетЗадолженность);  
	ДополнительныеПараметры.Вставить("Записать",		Ложь);  
	
	Оповещение = Новый ОписаниеОповещения("ВопросПередНачаломНастроекОтбора", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Объект.Ссылка.Пустая() Тогда
		ДополнительныеПараметры.Вставить("Записать", Истина);  
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Элемент справочника будет записан. Продлолжить?", Режим, 0);
	Иначе  
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ДоступенРазделОтчетыПриИзменении(Элемент) 
	
	ДоступенРазделОтчетыПриИзмененииНаСервере();

КонецПроцедуры 

&НаСервере
Процедура ДоступенРазделОтчетыПриИзмененииНаСервере()  
	
	Элементы.ГруппаПросроченнаяЗадолженность.Видимость = Объект.ДоступенРазделОтчеты;  
	
КонецПроцедуры

&НаКлиенте
Процедура ВебПрофилиПеревозокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = истина;
		ПоказатьПредупреждение(, "Необходимо записать элемент справочнка!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВебПрофилиЗаявокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Объект.Ссылка.Пустая() Тогда
		Отказ = истина;
		ПоказатьПредупреждение(, "Необходимо записать элемент справочнка!");
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ДоступныеВариантыОтчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КлючОбъекта", 		"Отчет.CW_ЛичныйКабинетДебиторскаЗадолженность");
	СтруктураПараметров.Вставить("КлючТекущихНастроек", Неопределено); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборВариантаОтчета", ЭтотОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.ХранилищеВариантовОтчетов.Форма.ВыборВариантаОтчета", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения)


КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборВариантаОтчета(РезультатВыбора, ДополнительныеПараметры) Экспорт   
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ЗавершитьВыборВариантаОтчетаНаСервере(РезультатВыбора, ДополнительныеПараметры);
	
КонецПроцедуры 

&НаСервере
Процедура ЗавершитьВыборВариантаОтчетаНаСервере(РезультатВыбора, ДополнительныеПараметры)   
	
	ВыбранныйВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоРеквизиту("КлючВарианта", РезультатВыбора.КлючНастроек);
	Если Не ЗначениеЗаполнено(ВыбранныйВариантОтчета) Тогда
		Возврат;
	КонецЕсли;       
	
	Отбор = Новый Структура("ВариантОтчета", ВыбранныйВариантОтчета);
	мСтроки = Объект.ДоступныеВариантыОтчета.НайтиСтроки(Отбор);
	Если мСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.ДоступныеВариантыОтчета.Добавить();
	НоваяСтрока.ВариантОтчета = ВыбранныйВариантОтчета;
	НоваяСтрока.КомандаСтроки = "Сформировать";
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОсновной(Команда)
	
	ОткрытьВариантОтчета("Основной")

КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	ТекущиеДанные = Элементы.ДоступныеВариантыОтчета.ТекущиеДанные; 
	КлючВарианта  = ПолучитьКлючТекущегоВариантаОтчета(ТекущиеДанные.ВариантОтчета);
	
	ОткрытьВариантОтчета(КлючВарианта);
	
КонецПроцедуры   

&НаКлиенте
Процедура ДоступныеВариантыОтчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.ГиперссылкаЯчейки Тогда
		ТекущиеДанные 	= Элементы.ДоступныеВариантыОтчета.ТекущиеДанные; 
		КлючВарианта 	= ПолучитьКлючТекущегоВариантаОтчета(ТекущиеДанные.ВариантОтчета);
		
		ОткрытьВариантОтчета(КлючВарианта);
	КонецЕсли;

КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПолучитьКлючТекущегоВариантаОтчета(ВариантОтчета)
	
	Если Не ЗначениеЗаполнено(ВариантОтчета) Тогда
		Возврат "Основной";
	КонецЕсли;
	
	Возврат ВариантОтчета.КлючВарианта;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьВариантОтчета(КлючВарианта)
	
	ФормаОтчета = ПолучитьФорму("Отчет.CW_ЛичныйКабинетДебиторскаЗадолженность.Форма");;
	ФормаОтчета.УстановитьТекущийВариант(КлючВарианта);
	
	Настройки = ПолучитьНастройки(ФормаОтчета.Отчет.КомпоновщикНастроек, АдресНастроекОтбораОтчетЗадолженность, Объект.ТипДополнительнойИнформации);
	ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	ФормаОтчета.СкомпоноватьРезультат();
	ФормаОтчета.Открыть();

КонецПроцедуры



&НаСервереБезКонтекста
Функция ПолучитьНастройки(КомпоновщикНастроек, АдресНастроек, ТипДополнительнойИнформции =0)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();  
	
	ХранимыеНастройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Для Каждого ЭлементОтбораПрофиля Из ХранимыеНастройки.Отбор.Элементы Цикл
		ЭлементОтбораОтчета = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(ЭлементОтбораОтчета, ЭлементОтбораПрофиля);
	КонецЦикла;
	
    Возврат Настройки;
	
КонецФункции

&НаСервере
Функция ПолучитьОтборИзНастроек()
	
	СтруктураОтбора = Новый Структура; 
	
	НастройкиОтчет = ПолучитьИзВременногоХранилища(АдресНастроекОтбораОтчетЗадолженность);
	Для Каждого ЭлементОтбора Из НастройкиОтчет.Отбор.Элементы Цикл  
		СтруктураОтбора.Вставить(СокрЛП(ЭлементОтбора.ЛевоеЗначение),ЭлементОтбора.ПравоеЗначение);
	КонецЦикла; 
	
	Возврат СтруктураОтбора;
	
КонецФункции

&НаКлиенте
Процедура ИспользуемыйВариантОтчетаПриИзменении(Элемент)

	ИспользуемыйВариантОтчетаПриИзмененииНаСервере(); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ИспользуемыйВариантОтчета1ПриИзменении(Элемент)
	
	ИспользуемыйВариантОтчетаПриИзмененииНаСервере(); 

КонецПроцедуры

&НаСервере
Процедура ИспользуемыйВариантОтчетаПриИзмененииНаСервере()
	
	Элементы.ГруппаДоступныеВариантыОтчета.Видимость = (Объект.ИспользуемыйВариантОтчета = 1); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступенРазделПеревозкиПриИзменении(Элемент)
	
	УстановитьДоступностьРазделаПеревозокНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьРазделаПеревозокНаСервере()

	Элементы.ВебПрофилиПеревозок.Видимость	= Объект.ДоступенРазделПеревозки;
	
КонецПроцедуры
